let period = prompt("Пора року", "")

if (period == "зима"){
	alert("Зараз зима");
} else if (period == "весна"){
	alert("Зараз весна");
} else if (period == "літо"){
	alert("Зараз літо");
} else if (period == "осінь"){
	alert("Зараз осінь");
} else{
	alert("Пори року " + period + " не існує");
}

додати перевірки: 

через тернарний оператор



друга задача: з попереднього дз (якщо депозит на 1-2 місяці то облікова ставка 10% річних, якщо від 3-9 місяців то 15% річних, від 9 до 11 місяців 17%, якщо більше року то 18%)
правильно обраховувати дроби

третя задача: два числа. Якщо А більше трьох і менше 12 або змінна Б більше або дорівнює 5 і менше 13 то вивести текст вірно інакше не вірно




перечитати про оператори (логічні оператори)


унарні, бінарні і тернарний 
унарний (застосовується до одного операнду (+а а++)
бінарні (до двох операндів)
тернарний (умова ? true : false)

typeof() - перевірка типу оператора
Number(a) - перетворити на число

Оператори: математичні, порівняння, умовні, логічні, побітові

== - нестроге (5 = "5") 
=== - строге (5 != "5")








