//FIRST TASK

let period = prompt("Пора року", "");
let message = (period == "зима") ? ("Зараз зима"):
	(period == "Зима") ? ("Зараз " + period):
	(period == "ЗИма") ? ("Зараз " + period):
	(period == "зИма") ? ("Зараз " + period):
	(period == "весна") ? ("Зараз " + period):
	(period == "літо") ? ("Зараз " + period):
	(period == "осінь") ? ("Зараз " + period):
	(period == "зИма") ?("Зараз " + period):
	("Пори року " + period + " не існує");
alert(message);




//SECOND TASK
let result, rate;
let sum = +prompt("Введіть суму", "");
let term = +prompt("Введіть термін", "");

rate = (1 <= term <= 2) ? (11):
	(3 <= term < 9) ? (15):
	(9 <= term <= 11) ? (17):
	(term >= 12) ? (18):("invalid value");

(rate == ("invalid value")) ? alert(rate):
	result = ((sum * rate) / 100) / 12; 

if (result !== null){
	alert("your monthly profit: " + result);
}

// alert(rate);




//THIRD TASK

let a = +prompt("Enter first value", "");
let b = +prompt("Enter second value", "");

let message = ((3 < a < 12) || (5 <= b < 13)) ? ("TRUE") : ("FALSE");
alert(message);



// додати перевірки: 

// через тернарний оператор



// друга задача: з попереднього дз (якщо депозит на 1-2 місяці то облікова ставка 10% річних, якщо від 3-9 місяців то 15% річних, від 9 до 11 місяців 17%, якщо більше року то 18%)
// правильно обраховувати дроби

// третя задача: два числа. Якщо А більше трьох і менше 12 або змінна Б більше або дорівнює 5 і менше 13 то вивести текст вірно інакше не вірно




// перечитати про оператори (логічні оператори)


// унарні, бінарні і тернарний 
// унарний (застосовується до одного операнду (+а а++)
// бінарні (до двох операндів)
// тернарний (умова ? true : false)

// typeof() - перевірка типу оператора
// Number(a) - перетворити на число

// Оператори: математичні, порівняння, умовні, логічні, побітові

// == - нестроге (5 = "5") 
// === - строге (5 != "5")



